brew "zoxide"
brew "bat"
brew "gh"
brew "rust"
brew "mise"
brew "fish"
brew "fontconfig"
brew "libyaml"
brew "coreutils"
cask "nikitabobko/tap/aerospace"
cask "github"
cask "visual-studio-code"
cask "raycast"
cask "keycastr"
cask "ghostty"
cask "orbstack"
