tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "git"
brew "gnu-tar"
brew "gnupg"
brew "mas"
brew "pinentry-mac"

cask "aerial"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "backblaze"
cask "bitwarden"
cask "obs"
cask "spotify"
cask "vlc"
cask "vscodium"
cask "zoom"

mas "Effortless", id: 1368722917
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905